### Lahman Baseball - Python

In [1]:
import pandas as pd
from sqlalchemy import create_engine

In [2]:
engine = create_engine("postgres+psycopg2://postgres:postgres@localhost:5432/lahman_baseball")

In [3]:
batting_df = pd.read_sql("SELECT * FROM batting;", con=engine)
batting_df.head()

,playerid,yearid,stint,teamid,lgid,g,ab,r,h,h2b,...,rbi,sb,cs,bb,so,ibb,hbp,sh,sf,gidp
0,abercda01,1871,1,TRO,NA,1,4,0,0,0,...,0.0,0.0,0.0,0,0.0,NaN,NaN,NaN,NaN,NaN
1,addybo01,1871,1,RC1,NA,25,118,30,32,6,...,13.0,8.0,1.0,4,0.0,NaN,NaN,NaN,NaN,NaN
2,allisar01,1871,1,CL1,NA,29,137,28,40,4,...,19.0,3.0,1.0,2,5.0,NaN,NaN,NaN,NaN,NaN
3,allisdo01,1871,1,WS3,NA,27,133,28,44,10,...,27.0,1.0,1.0,0,2.0,NaN,NaN,NaN,NaN,NaN
4,ansonca01,1871,1,RC1,NA,25,120,29,39,11,...,16.0,6.0,2.0,2,1.0,NaN,NaN,NaN,NaN,NaN

##### Question 1. 
#### a. Find all players in the database who played at Vanderbilt University.
#### b. Create a list showing each player’s first and last names as well as the total salary they earned in the major leagues.
#### c. Sort this list in descending order by the total salary earned.
#### d. Which Vanderbilt player earned the most money in the majors?

In [4]:
sql_code_vandyplayers = pd.read_sql("SELECT CONCAT(p.namefirst, ' ', p.namelast), cp.schoolid, SUM(s.salary) AS total_salary FROM people AS p INNER JOIN collegeplaying as cp ON p.playerid = cp.playerid INNER JOIN salaries as s ON cp.playerid = s.playerid WHERE cp.schoolid = 'vandy' GROUP BY p.namefirst, p.namelast, cp.schoolid ORDER BY total_salary DESC;", con=engine)
sql_code_vandyplayers.head(1)

        concat schoolid  total_salary
0  David Price    vandy   245553888.0

In [5]:
collegeplaying = pd.read_sql("SELECT * FROM collegeplaying;", con=engine)
collegeplaying.head(1)

    playerid schoolid  yearid
0  aardsda01   pennst    2001

In [6]:
people = pd.read_sql("SELECT * FROM people;", con=engine)
people.head(1)

,playerid,birthyear,birthmonth,birthday,birthcountry,birthstate,birthcity,deathyear,deathmonth,deathday,...,namelast,namegiven,weight,height,bats,throws,debut,finalgame,retroid,bbrefid
0,aardsda01,1981.0,12.0,27.0,USA,CO,Denver,NaN,NaN,NaN,...,Aardsma,David Allan,215.0,75.0,R,R,2004-04-06,2015-08-23,aardd001,aardsda01

In [7]:
salaries = pd.read_sql("SELECT * FROM salaries;", con=engine)
salaries.head(1)

   yearid teamid lgid   playerid    salary
0    1985    ATL   NL  barkele01  870000.0

In [8]:
vandy_players = collegeplaying[collegeplaying['schoolid'].isin(['vandy'])]
vandy_players_salaries.head()

      playerid schoolid  yearid
232  alvarpe01    vandy    2006
233  alvarpe01    vandy    2007
234  alvarpe01    vandy    2008
895  baxtemi01    vandy    2004
896  baxtemi01    vandy    2005

In [26]:
type(vandy_players_salaries)

pandas.core.series.Series

In [ ]:
vandy_players_salaries[firstname] = pd.merge()

In [31]:
vandy_players_salaries = pd.merge(vandy_players, salaries, on='playerid').groupby('playerid')['salary'].sum()
vandy_players_salaries.head()

playerid
alvarpe01    62045112.0
baxtemi01     4188836.0
chrisni01     2000000.0
corajo01     16867500.0
flahery01    12183000.0
Name: salary, dtype: float64

In [32]:
type(vandy_players_salaries)

pandas.core.series.Series

In [30]:
vandy_players_salaries.sort_values('salary', ascending=False)
vandy_players_salaries

ValueError: No axis named salary for object type <class 'pandas.core.series.Series'>